docs/mythic-rpg.org
#+TITLE:  Mythic TTRPG
#+AUTHOR: Howard X. Abrams
#+DATE:   2021-08-09 August
#+TAGS:   rpg

I'm intrigued with the possibilities associated with Tana Pigeons's (from Word Mill Games) TTRPG, [[http://wordmillgames.com/mythic-rpg.html][Mythic]], however, to make things quicker (at least for me), I'm going to try to render the Fate Chart and other aspects from the book.

To summarize, we ask ourselves questions about the situation our characters find themselves. These questions much adhere to these /rules/:

  - The question is often what a player would ask their game master.
  - The answer must be either /yes/ or /no/.
  - The question must be /logical/ (for the story, not necessarily reality).

We then rate the /challenge/ or /likelihood/ of the question on the following scale (so send this list to all other placyers):

This is the /likelihood/ gradient levels:

  - impossible
  - no way
  - very unlikely
  - unlikely
  - *50/50* ... note that this is the middle ground, and everything above is less likely to be a /yes/ and everything below this is /more likely/ to be yes.
  - maybe
  - likely
  - probably
  - near sure
  - sure thing
  - absolutely

And this is the /challenge levels/:

  - trivial
  - miniscule
  - weak
  - low
  - below average (will accept a negative)
  - average
  - above average
  - high
  - exceptional
  - incredible
  - awesome
  - superhuman
  - superhuman+

We typically don't bother with the challenge levels, as we just allow our D&D rules carry these situations. Also, usually the person that asks the question allows the other players to determine the likelihood level.


#+BEGIN_SRC emacs-lisp :exports none
;;; rpgdm-mythic.org --- Functions to help when playing Mythic RPG. -*- lexical-binding: t; -*-
;;
;; Copyright (C) 2021 Howard X. Abrams
;;
;; Author: Howard X. Abrams <http://gitlab.com/howardabrams>
;; Maintainer: Howard X. Abrams <howard.abrams@gmail.com>
;; Created: 9 August 2021
;;
;; This file is not part of GNU Emacs.
;;
;;; Commentary:
;;
;;    This source code is literally extracted from an essay about creating an
;;    user interface to the Mythic RPG game system. See the book,
;;    http://wordmillgames.com/mythic-rpg.html
;;
;;; Code:
#+END_SRC
* Introduction
I'm not sure why I'm here. I guess I'm just curious. Mumma said that was what would kill me. Just like that tentacled kitten my father found in the woods. Here I am, at Her House.

Am I here to deliver something? No. Am I here to get something? No. Am I here to /learn/ something? Not that either. Am I hear to deliver a message? Hrm ... really rolling high. No, not that.

I guess I just came here because I was curious.

Does the place look peculiar or /odd/? Yes. An exceptional yes.

I came here to see if the rumors are true. The house, if you could call it a house isn't anything like the others at the village. Is it a tower? No. Does it even look like a house? No. She must live in a stone sphere here in the middle of the forest.

Is there a door? I would assume so. Yes, there is. Is the stone ball floating? I mean, I have heard about the magics and that seems like something she might employ. Yes. It is floating just out of reach. I suppose I have seen what I came to see. The rumors are true, she lives in a floating stone ball.

Does She have windows, or does She use magics to view the land around her dwelling. No, She uses magics. The stone is featureless, except for the door. I move closer and wonder how She goes in and out. Is there an invisible stair to aid her? Seems very likely, but (exceptional no) I can walk right underneath it without noticing that. But when I come closer, the stone sphere floats further away.

Curiouser. I wonder what She is like. Would she be angry if I knocked on the door? Assuming I could reach it. I want to know more about her, otherwise, I couldn't live with the mystery. I pick up a rock and throw it at the door, while I'm a pretty strong thrower, the door is far away.

The stone hits the door. Does someone open the door? Yes! After some time, the stone door creaks open. Is it Her? No! It must be one of Her servants. Is it human? (Exceptional no). A small goblin girl peers around looking for what made the noise. Does the goblin look angry? I didn't hurt the door, so maybe she is just as curious as I. But she is! Exceptionally so! I quickly hide in the forest undergrowth. Does she see me? Due to my curious nature, I've always been sneaky (else how would I have heard all the delicious rumors), however, the goblin looks straight at me, as if I wasn't even hiding.

Does she do something to me? Yes. Does she use magic? Yes.

Curiosity may have killed the tentacled kitten, but curiosity turned this human into a tentacled cat.
* Interface
Since I will be using Mythic features primarily while either writing (or at least, taking notes), the user interface needs to be un-intrusive. I'll just put everything under leader keys using Doom macros:

#+BEGIN_SRC emacs-lisp
(map! :leader (:prefix-map ("a" . "abrams")
                (:prefix-map ("r" . "rpg-dm")
                  :desc "table choice"        "c" 'rpgdm-tables-choose
                  :desc "roll the dice"       "r" 'rpgdm-roll
                  :desc "best/middling/worse" "z" 'rpgdm-oracle
                  :desc "flip coin, and..."   "a" 'rpgdm-yes-and-50/50
                  :desc "new adventure"       "N" 'rpgdm-mythic-new-adventure
                  :desc "new scene"           "n" 'rpgdm-mythic-new-scene
                  :desc "what are the odds?"  "o" 'rpgdm-mythic-fate-odds
                  :desc "skill challenge"     "f" 'rpgdm-mythic-fate-challenge)))
#+END_SRC

What I've noticed is that I would like to run these commands while actually editing, so let's have a new key sequence that begins with ~F19~ on my fancy keyboard.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "<f19> c") 'rpgdm-tables-choose)
(global-set-key (kbd "<f19> r") 'rpgdm-roll)
(global-set-key (kbd "<f19> z") 'rpgdm-oracle)
(global-set-key (kbd "<f19> a") 'rpgdm-yes-and-50/50)
(global-set-key (kbd "<f19> N") 'rpgdm-mythic-new-adventure)
(global-set-key (kbd "<f19> n") 'rpgdm-mythic-new-scene)
(global-set-key (kbd "<f19> o") 'rpgdm-mythic-fate-odds)
(global-set-key (kbd "<f19> f") 'rpgdm-mythic-fate-challenge)
#+END_SRC
And because I use the /odds/ chart a lot more than anything else. I'm going to bind it to another, easier key.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "<f15>") 'rpgdm-mythic-fate-odds)
#+END_SRC

Some of these functions are from my [[file:rpgdm.el][rpgdm.el]] code, while the Mythic-specific ones, we define here, primarily:

  - =new-adventure= :: To create a directory structure of org-mode files to document/retell the adventure as it unfolds.
  - =fate-odds= :: To determine, based on the current chaos level, what are the odds of something. I will use that a lot.
  - =fate-challenge= :: The primary Fate Chart use case where two "levels" compete on a bell curve of chance.
