rpgdm-mythic.el
;;; rpgdm-mythic.org --- Functions to help when playing Mythic RPG. -*- lexical-binding: t; -*-
;;
;; Copyright (C) 2021 Howard X. Abrams
;;
;; Author: Howard X. Abrams <http://gitlab.com/howardabrams>
;; Maintainer: Howard X. Abrams <howard.abrams@gmail.com>
;; Created: 9 August 2021
;;
;; This file is not part of GNU Emacs.
;;
;;; Commentary:
;;
;;    This source code is literally extracted from an essay about creating an
;;    user interface to the Mythic RPG game system. See the book,
;;    http://wordmillgames.com/mythic-rpg.html
;;
;;; Code:

(map! :leader (:prefix-map ("a" . "abrams")
                (:prefix-map ("r" . "rpg-dm")
                  :desc "table choice"        "c" 'rpgdm-tables-choose
                  :desc "roll the dice"       "r" 'rpgdm-roll
                  :desc "best/middling/worse" "z" 'rpgdm-oracle
                  :desc "flip coin, and..."   "a" 'rpgdm-yes-and-50/50
                  :desc "new adventure"       "N" 'rpgdm-mythic-new-adventure
                  :desc "new scene"           "n" 'rpgdm-mythic-new-scene
                  :desc "what are the odds?"  "o" 'rpgdm-mythic-fate-odds
                  :desc "skill challenge"     "f" 'rpgdm-mythic-fate-challenge)))

(global-set-key (kbd "<f19> c") 'rpgdm-tables-choose)
(global-set-key (kbd "<f19> r") 'rpgdm-roll)
(global-set-key (kbd "<f19> z") 'rpgdm-oracle)
(global-set-key (kbd "<f19> a") 'rpgdm-yes-and-50/50)
(global-set-key (kbd "<f19> N") 'rpgdm-mythic-new-adventure)
(global-set-key (kbd "<f19> n") 'rpgdm-mythic-new-scene)
(global-set-key (kbd "<f19> o") 'rpgdm-mythic-fate-odds)
(global-set-key (kbd "<f19> f") 'rpgdm-mythic-fate-challenge)

(global-set-key (kbd "<f15>") 'rpgdm-mythic-fate-odds)
