docs/mythic-rpg.org
** Questions?
Can I ask a lengthy question with a one letter response? This function will issue a prompt with all the ranks available, get a single keystroke (using the =read-char= function), and return the numeric value of the rank, we can send to the other functions for the Fate Chart.

#+BEGIN_SRC emacs-lisp :results silent
(defun rpgdm-mythic-rank-level (&optional rank-type)
  "Query user and return a numeric 'rank' level.
This number is from -5 to 7, where 0 is a average."
  (let* ((prompt (format "Choose a %sMythic Rank:
  t) Trivial  m) Miniscule    w) Weak        l) Low      b) Below Average  a) Average  A) Above Average
  H) High     E) Exceptional  I) Incredible  W) Awesome  S) Superhuman     V) Very Superhuman "
                         (or rank-type "")))
         (ascii (read-char (rpgdm--prompt-emphasis prompt))))
    (cond
     ((eq ascii ?t)                                  -5) ; t -> trivial
     ((eq ascii ?m)                                  -4) ; m -> miniscule
     ((eq ascii ?w)                                  -3) ; w -> weak                                      -
     ((eq ascii ?l)                                  -2) ; l -> low                                       - terrible
     ((or (eq ascii ?b) (eq ascii ?-))               -1) ; b -> below average (will accept a negative)    - poor
     ((or (eq ascii ?A) (eq ascii ?1) (eq ascii ?+))  1) ; A -> above average                             - average
     ((or (eq ascii ?H) (eq ascii ?h) (eq ascii ?2))  2) ; h -> high                                      - Fair
     ((or (eq ascii ?E) (eq ascii ?e) (eq ascii ?3))  3) ; e -> exceptional                               - Good
     ((or (eq ascii ?I) (eq ascii ?i) (eq ascii ?4))  4) ; i -> incredible                                - Great
     ((or (eq ascii ?W) (eq ascii ?5))                5) ; W -> awesome                                   - Superb
     ((or (eq ascii ?S) (eq ascii ?6))                6) ; s -> superhuman                                - Fantastic
     ((or (eq ascii ?V) (eq ascii ?7))                7) ; S -> superhuman+                               - Epic
     (t                                               0)))) ; * -> Average                                - mediocre
#+END_SRC

And we can also convert a list of /what are the odds/ for events and whatnot:

#+BEGIN_SRC emacs-lisp :results silent
(defun rpgdm-mythic-odds-level ()
  "Query user and return a numeric 'odds' level.
This number is from -4 to 6, where 0 is a 50/50."
  (let ((ascii (read-char (rpgdm--prompt-emphasis "What is the likelihood of your question?
  i) Impossible  n) No way  v) Very unlikely u) Unlikely   h) 50/50
  M) Maybe       L) Likely  P) Probably      N) Near Sure  S) Sure thing  A) Absolutely"))))
    (cond
     ((eq ascii ?i)                                   -4) ; i -> impossible
     ((eq ascii ?n)                                   -3) ; n -> no way
     ((eq ascii ?v)                                   -2) ; v -> very unlikely
     ((or (eq ascii ?u)               (eq ascii ?-))  -1) ; u -> unlikely
     ((or (eq ascii ?M) (eq ascii ?m) (eq ascii ?1))   1) ; M -> maybe
     ((or (eq ascii ?L) (eq ascii ?l) (eq ascii ?2))   2) ; L -> likely
     ((or (eq ascii ?P) (eq ascii ?p) (eq ascii ?3))   3) ; P -> probably
     ((or (eq ascii ?N) (eq ascii ?s) (eq ascii ?4))   4) ; N -> near sure
     ((or (eq ascii ?S) (eq ascii ?t) (eq ascii ?5))   5) ; S -> sure thing
     ((or (eq ascii ?A) (eq ascii ?a)
          (eq ascii ?Y) (eq ascii ?y) (eq ascii ?6))   6) ; A -> absolutely
     (t                                                0)))) ; * -> 50/50
#+END_SRC

And finally, we need to get the /chaos level/. From the Mythic RPG book about the chaos level:

#+begin_quote
The higher the number, the more unexpected events occur. Chaos can also influence the results of odds questions.
The higher the chaos, the more frequently odds questions come up yes. Since yes answers usually add elements to an adventure, the higher the chaos factor, the more action you will have as a result of odds questions.
#+end_quote
While the chart's labels are 1 to 9, we need to convert them to the -4 to 4 range similar to the others:

#+BEGIN_SRC emacs-lisp :results silent
(defun rpgdm-mythic-chaos-level ()
  "Query user and return a numeric 'chaos' level.
Where `1' means a stable environment where most yes/no questions
are no, and `9' is chaotic, and more often responds with yes.
Return number is from -4 to 4, where 0 is normal."
  (let* ((prompt (format "What is the Chaos level (1-9)?
Where 1 is very stable (more noes), and 9 is chaotic (more yeses), and <RET> selects the current value, %d"
                         rpgdm-mythic-current-chaos-level))
        (ascii (read-char prompt)))
    (cond
     ((eq ascii ?9) -4)
     ((eq ascii ?8) -3)
     ((eq ascii ?7) -2)
     ((eq ascii ?6) -1)
     ((eq ascii ?5)  0)
     ((eq ascii ?4)  1)
     ((eq ascii ?3)  2)
     ((eq ascii ?2)  3)
     ((eq ascii ?1)  4)
     (t              (- rpgdm-mythic-current-chaos-level 5)))))
#+END_SRC

Would be nice to visually see the keystrokes in a different color. Can I do this automatically?
The =put-text-property= can change textual properties within a string, and since all of these prompts have a particular pattern, I can use it to easily identify the keys:

#+BEGIN_SRC emacs-lisp :results silent
(defun rpgdm--prompt-emphasis (message)
  "Add emphasizing properties to the keystroke prompts in MESSAGE."
  (let ((start 0)
        (re (rx bow (one-or-more (not space)) ") ")))
    (while (string-match re message start)
      (let* ((key-start (match-beginning 0))
             (key-end   (1+ key-start))
             (par-start  key-end)
             (par-end   (1+ par-start)))
        (put-text-property key-start key-end 'face '(:foreground "green") message)
        (put-text-property par-start par-end 'face '(:foreground "#666666") message))
      (setq start (match-end 0))))
  message)
#+END_SRC

** Requests?
The initial request in Mythic RPG is the /challenge/. It requires two /ranks/, the initial actor (probably the player) vs. a contested /difficulty/ rank, like another NPC, or the strength of the door, etc. After querying for the ranks, we can just pass those values to the =rpgdm-mythic-fate-chart= function to do all the work:

#+BEGIN_SRC emacs-lisp :results silent
(defun rpgdm-mythic-fate-challenge (acting-rank acting-modifier difficulty-rank)
  "Request a challange on the tables of fate.
Send a message of the results of rolling a d100 on the Mythic
Fate Chart. The ACTING-RANK and DIFFICULTY-RANK are numeric
values from -5 to 7 (with 0 being average)."
  (interactive (list (rpgdm-mythic-rank-level "Acting ")
                     (read-number "Actiing modifier? " 0)
                     (rpgdm-mythic-rank-level "Difficulty ")))
  (rpgdm-mythic-fate-chart "Challenge " (+ acting-rank acting-modifier) difficulty-rank))
#+END_SRC

What are the odds of something happening? A little luck, a little logic, and a bit of the /chaos/ associated with the unfolding of the story:

#+BEGIN_SRC emacs-lisp :results silent
(defun rpgdm-mythic-fate-odds (odds chaos-level)
  "Request a results of what are the odds on the tables of fate.
Send a message of the results of rolling a d100 on the Mythic
Fate Chart. The ODDS is the likelihood of something, and the
CHAOS-LEVEL is a numeric values about how likely yes answer
happen."
  (interactive (list (rpgdm-mythic-odds-level)
                     (rpgdm-mythic-chaos-level)))
  (rpgdm-mythic-fate-chart "Odds " odds chaos-level))
#+END_SRC
* Fate Chart
The main table/chart in the Mythic RPG is the *Fate Chart* that specifies all questions and conflict resolution. This interactive function should return the range, a d100 die roll, and also interpret the results. We can then use any aspect of the results.

#+BEGIN_SRC emacs-lisp :results silent
(defun rpgdm-mythic-fate-chart (chart-type x-rank y-rank)
  "Return a colorized message of rolling dice against the Fate Chart.
Use the X-RANK and Y-RANK as indexes in the Mythic RPG Fate
chart (see `rpgdm-mythic--fate-chart'), and format the collected
messages."
  (let* ((range   (rpgdm-mythic--fate-chart x-rank y-rank))
         (roll    (rpgdm--roll-die 100))
         (results (rpgdm-mythic--result-message range roll))
         (event?  (rpgdm-mythic--result-event-p range roll))
         (message (format "Mythic %s- %d < %d < %d :: %d ... %s %s"
                   chart-type (first range) (second range) (third range) roll results event?)))
    (rpgdm-message (rpgdm-mythic--fate-chart-emphasize message))))
#+END_SRC

