rpgdm-mythic.el

(let ((fate-table-values '((50 25 10 5 5 0 0 -20 -20 -40 -40 -55 -65) (75 50 25 15 10 5 5 0 0 -20 -20 -35 -45) (90 75 50 35 25 15 10 5 5 0 0 -15 -25) (95 85 65 50 45 25 15 10 5 5 5 5 -15) (100 90 75 55 50 35 20 15 10 5 5 0 -10) (105 95 85 75 65 50 35 25 15 10 10 5 -5) (110 95 90 85 80 65 50 45 25 20 15 5 0) (115 100 95 90 85 75 55 50 35 25 20 10 5) (120 105 95 95 90 85 75 65 50 45 35 15 5) (125 115 100 95 95 90 80 75 55 50 45 20 10) (130 125 110 95 95 90 85 80 65 55 50 25 10) (150 145 130 100 100 95 95 90 85 80 75 50 25) (170 165 150 120 120 100 100 95 95 90 90 75 50))))
(defvar rpgdm-mythic-fate-table fate-table-values
  "Only contains the medium boundary values of the Mythic Fate Chart.")
)

(defun rpgdm-mythic--fate-boundary (acting-rank difficulty-rank)
  "Return the boundary value for a fate contest. The ACTING-RANK
and DIFFICULTY-RANK are numeric values from -5 to 7 that
correspond to the rows and colums of the Fate Chart from the
Mythic RPG."
  (nth (+ difficulty-rank 5)
       (nth (+ acting-rank 5) rpgdm-mythic-fate-table)))

(defun rpgdm-mythic--fate-chart (acting-rank difficulty-rank)
  "Return a list of the lower, medium and upper boundaries of the Fate Chart.
The ACTING-RANK and DIFFICULTY-RANK are numeric values from -5 to
7 that correspond to the rows and colums of the Fate Chart, for
instance, a value of _weak_ on the chart is a -3, and a value of
_incredible_ is a 4."
  (let* ((medium (rpgdm-mythic--fate-boundary acting-rank difficulty-rank))
         (lower  (if (> medium 0)   (/ medium 5)         0))
         (upper  (if (< medium 100)
                     (- 100 (/ (- 100 medium) 5)) 100)))
    (list lower medium upper)))

(ert-deftest rpgdm-mythic--fate-chart-test ()
  (should (equal (rpgdm-mythic--fate-chart 0 0)   '(10 50 90)))
  (should (equal (rpgdm-mythic--fate-chart 7 7)   '(10 50 90)))
  (should (equal (rpgdm-mythic--fate-chart -5 -5) '(10 50 90)))
  (should (equal (rpgdm-mythic--fate-chart -5 7)  '(0 -65 67)))
  (should (equal (rpgdm-mythic--fate-chart 7 -5)  '(34 170 100)))
  (should (equal (rpgdm-mythic--fate-chart -1 2)  '(3 15 83))))

(defun rpgdm-mythic--result-message (chart-range die-roll)
  "Return result message of a DIE-ROLL within the three numbers from the CHART-RANGE."
  (cond
   ((<= die-roll (first chart-range))  "Exceptional yes")
   ((<= die-roll (second chart-range)) "Yes")
   ((<= die-roll (third chart-range))  "No")
   (t                                  "Exceptional no")))

(defun rpgdm-mythic--result-event-p (chart-range die-roll)
  "Return a random event message of a DIE-ROLL within the yes values of the CHART-RANGE."
  (let ((tens (/ die-roll 10))
        (ones (mod die-roll 10)))
    (when (and (= ones tens)
               (<= die-roll (second chart-range)))
      " <Random Event>")))

(ert-deftest rpgdm-mythic--result-event-p-test ()
  (should (rpgdm-mythic--result-event-p '(10 50 90) 11))
  (should (rpgdm-mythic--result-event-p '(10 50 90) 44))
  (should (not (rpgdm-mythic--result-event-p '(10 50 90) 88)))
  (should (not (rpgdm-mythic--result-event-p '(10 50 90) 13))))

(defun rpgdm-mythic--fate-chart-emphasize (message)
  "We make certain assumption about the format of the message."
  (let ((roll-re (rx ":: " (group (one-or-more digit))))
        (main-re (rx "< " (group (one-or-more digit)) " <"))
        (punc-re (rx "..."))
        (rest-re (rx "... " (group (one-or-more any)))))
    (string-match roll-re message)
    (put-text-property (match-beginning 1) (match-end 1) 'face '(:foreground "yellow") message)
    (string-match main-re message)
    (put-text-property (match-beginning 1) (match-end 1) 'face '(:foreground "green") message)
    (string-match rest-re message)
    (put-text-property (match-beginning 1) (match-end 1) 'face '(:foreground "white") message)
    (string-match punc-re message)
    (put-text-property (match-beginning 0) (match-end 0) 'face '(:foreground "#666666") message)
    message))

(defvar rpgdm-mythic-current-chaos-level 5 "The current, and adjustable, default chaos level")

(defun rpgdm-mythic-set-chaos-level (level)
  "Change the `rpgdm-mythic-current-chaos-level' to LEVEL.
This value can be an absolute number, or can be a relative value
if prefixed with a `+' or `-'. Notice it takes a string..."
  (interactive "sNew chaos level for current game: ")
  (let* ((parse-re (rx (optional (group (any "+" "-")))
                       (group digit)))
         (matcher  (string-match parse-re level))
         (sign     (match-string 1 level))
         (value    (string-to-number (match-string 2 level))))
    (setq rpgdm-mythic-current-chaos-level (cond
                                            ((equal sign "=") (- rpgdm-mythic-current-chaos-level value))
                                            ((equal sign "+") (+ rpgdm-mythic-current-chaos-level value))
                                            ((> value 0)      value)))))

(defun rpgdm-mythic-increase-chaos-level ()
  "Increase the current chaos level by 1."
  (interactive)
  (setq rpgdm-mythic-current-chaos-level (1+ rpgdm-mythic-current-chaos-level)))

(defun rpgdm-mythic-decrease-chaos-level ()
  "Decrease the current chaos level by 1."
  (interactive)
  (setq rpgdm-mythic-current-chaos-level (1- rpgdm-mythic-current-chaos-level)))

(defun rpgdm-mythic-random-event ()
  "Use `rpgdm-tables-choose' to select items from tables designed for Mythic.
Make sure the following tables have been loaded before calling this function:
  • `mythic/event-focus'
  • `mythic/actions'
  • `mythic/subject'
Perhaps we should make sure that we load this beforehand."
  (interactive)
  (let ((focus (rpgdm-tables-choose "mythic/event-focus"))
        (action (rpgdm-tables-choose "mythic/actions"))
        (subject (rpgdm-tables-choose "mythic/subject")))
    (rpgdm-message "Mythic Random Event- Focus: %s  Action: %s  Subject: %s"
                   (propertize focus 'face '(:foreground "yellow"))
                   (propertize action 'face '(:foreground "green"))
                   (propertize subject 'face '(:foreground "green")))))
