rpgdm-mythic.el

(defun rpgdm-mythic-new-scene (chaos-factor)
  "After planning the next scene, call this to see if that happens.
The scene may change based on the given CHAOS-FACTOR.
The message display may state that the scene is altered or interrupted."
  (interactive (list (rpgdm-mythic-chaos-level)))
  (let* ((roll (rpgdm--roll-die 10))
         (mess (cond
                ((and (<= roll chaos-factor) (evenp roll)) "The scene is interrupted")
                ((and (<= roll chaos-factor) (oddp roll))  "The scene is altered")
                (t                                         "The scene proceeds as planned"))))
    (rpgdm-message mess)))

(defun rpgdm-mythic-new-adventure (name)
  "Create directory structure for adventure of NAME."
  (interactive "sName this adventure: ")
  (let* ((dirname (->> "Hunting Goblins"
                       (downcase)
                       (s-replace-all '((" " . "-")))))
         (fullpath (format "~/projects/mythic-adventures/%s" dirname))
         (overview (format "%s/overview.org" fullpath)))
    (make-directory (format "%s/players" fullpath) t)
    (make-directory (format "%s/characters" fullpath) t)
    (make-directory (format "%s/scaling-boxes" fullpath) t)
    (make-directory (format "%s/resolution-charts" fullpath) t)
    (find-file overview)))

(set-file-template! (rx "/mythic-adventures/" (one-or-more any) "/players/")
  :trigger "__mythic_rpg_player" :mode 'org-mode)
(set-file-template! (rx "/mythic-adventures/" (one-or-more any) "/characters/")
  :trigger "__mythic_rpg_character" :mode 'org-mode)
(set-file-template! (rx "/mythic-adventures/" (one-or-more any) "/scaling-boxes/")
  :trigger "__mythic_rpg_scaling" :mode 'org-mode)
(set-file-template! (rx "/mythic-adventures/" (one-or-more any) "/resolution-charts/")
  :trigger "__mythic_rpg_resolution" :mode 'org-mode)
(set-file-template! (rx "/mythic-adventures/overview.org")
  :trigger "__mythic_rpg_overview" :mode 'org-mode)

(provide 'rpgdm-mythic)
;;; rpgdm.el ends here
